juthomas/I2S-ESP32-SD/src/main.cpp
// Lecteur Wav/Mp3/m4a Avec des signaux UDP
// Dependance : https://github.com/schreibfaul1/ESP32-audioI2S
//
// La carte Sd doit etre formatée soit en FAT16 soit en FAT32
// pour le format FAT32, il faut formatter la carte sd avec cet outil:
// https://www.sdcard.org/downloads/formatter/
//
// Les fichiers audios sont à mettre à la racine de la carte SD
//
// Les Signaux UDP possibles sont :
//
// Track : "0" à nombre de tracks audios
//
// Volume : "V 0" à "V 255"
//
// Pause/Resume : "P" pour alterner en pause et reprendre la lecteur,
// "P 0" pour mettre en pause, "P 1" pour reprendre la lecture.
//
// Loop file : "L" pour alterner en looper et ne pas looper,
// "L 0" pour ne pas looper, "L 1" pour looper.
//
// Balance : "B -16" à "B 16"
//
// Jump : "J 60" pour aller à un endroit specifique dans la track,
// 60 = 60 secondes
//
// Tonality : "T -40 0 6" fonctionne comme un equilibreur,
// le premier nombre est le gain pour les graves,
// le deuxieme pour les médiums et le troisieme pour les aigus,
// le gain va de -40 à 6 (en dB)

#include "Arduino.h"
#include "WiFi.h"
#include "jsonParser.h"
#include "ESPAsyncWebServer.h"
#include <DNSServer.h>
#include "freertos/FreeRTOS.h"
#include "freertos/queue.h"
#include "freertos/task.h"
#include "Audio.h"
#include "SD.h"
#include "FS.h"
#include "sstream"
#include <Adafruit_NeoPixel.h>

#include "PCF8575.h"
#include "esp32-hal-adc.h"

//  adjust addresses if needed
PCF8575 PCF(0x20);
// Memorize last read value of PCF pins (1 = HIGH, 0 = LOW)
static uint16_t pcfPrevValue = 0xFFFF;

// branchement Carte SD
#define SD_CS 5
#define SPI_MOSI 23
#define SPI_MISO 19
#define SPI_SCK 18

// Branchement Amplificateur I2S
#define I2S_DOUT 25
#define I2S_BCLK 27
#define I2S_LRC 26
#define I2S_ENABLE 17
// Buttons to adjust audio balance
#define BTN_INC_BAL 14 // increase balance (right)
#define BTN_DEC_BAL 16 // decrease balance (left)
#define BTN_PLAY_PAUSE 33 // toggle play/pause
#define PCF_INT_PIN 15

#define PCF_PULL_STATE LOW

#define CHRG_STATUS 13
#define LED_IO4 4

#define USB_VOLTAGE_PIN 32
//Not working on Rev1
#define BATTERY_VOLTAGE_PIN 34 // use ADC1 pin to avoid Wi-Fi blocking ADC2

String ssid = "punkhazard";
String password = "00000000";
// String ssid = "SFR_B4C8";                 // nom du routeur
// String ssid = "Livebox-75C0";                 // nom du routeur
// String ssid = "Bbox-7A159A77-2.4G";     // nom du routeur
// String password = "UxWygsEU44zhs3ynNG"; // mot de passe
// String password = "enorksenez3vesterish"; // mot de passe
// String password = "ipW2j3EzJQg6LF9Er6"; // mot de passe

IPAddress ip(192, 168, 0, 104);    // Local IP (static)
IPAddress gateway(192, 168, 0, 2); // Router IP
unsigned int localPort = 8266;     // port de reception UDP
IPAddress subnet(255, 255, 255, 0);

bool loop_file = true;               // Default loop audio files
const bool REQUEST_STATIC_IP = true; // Demander l'attribution d'une ip statique
bool auto_play = false;              // Lit la premiere track au demarrage
const bool DEBUG = true;             // Afficher les messages dans la console
namespace patch
{
    template <typename T>
    std::string to_string(const T &n)
    {
        std::ostringstream stm;
        stm << n;
        return stm.str();
    }
}
typedef struct s_music_data
{
    String path;
    uint8_t index;
} t_music_data;

String note = "";
uint8_t volume;
std::vector<t_music_data> music_data;
std::vector<String> files_list;
Audio audio;
WiFiUDP udp;
AsyncWebServer server(80);
DNSServer dnsServer;
// NeoPixel (WS2812) on IO4, 4 LEDs
static const uint8_t NEO_PIN = LED_IO4;
static const uint16_t NEO_COUNT = 4;
static Adafruit_NeoPixel strip(NEO_COUNT, NEO_PIN, NEO_GRB + NEO_KHZ800);
static uint16_t rainbowOffset = 0;
static uint32_t lastRainbowMs = 0;

static uint32_t colorWheel(uint8_t pos)
{
    pos = 255 - pos;
    if (pos < 85)
    {
        return strip.Color(255 - pos * 3, 0, pos * 3);
    }
    if (pos < 170)
    {
        pos -= 85;
        return strip.Color(0, pos * 3, 255 - pos * 3);
    }
    pos -= 170;
    return strip.Color(pos * 3, 255 - pos * 3, 0);
}

static void updateRainbow(uint32_t nowMs)
{
    const uint32_t intervalMs = 5; // ~50 FPS
    if (nowMs - lastRainbowMs < intervalMs) return;
    lastRainbowMs = nowMs;
    for (uint16_t i = 0; i < NEO_COUNT; ++i)
    {
        uint8_t wheelPos = (uint8_t)(((i * 64) / NEO_COUNT + rainbowOffset) & 0xFF);
        strip.setPixelColor(i, colorWheel(wheelPos));
    }
    strip.show();
    rainbowOffset++;
}
// Balance control state
int8_t currentBalance = 0;               // valid range: -16 (left) .. +16 (right)
bool prevBtnIncPressed = true;           // using INPUT_PULLUP, idle is HIGH
bool prevBtnDecPressed = true;           // using INPUT_PULLUP, idle is HIGH
unsigned long lastBalanceButtonMs = 0;   // debounce timer
const unsigned long balanceDebounceMs = 200;

// FreeRTOS primitives for button handling via ISR
typedef enum { BTN_EVT_INC = 1, BTN_EVT_DEC = 2, BTN_EVT_PLAY_PAUSE = 3, BTN_EVT_PCF_INT = 4 } ButtonEvent;
static QueueHandle_t buttonQueue = NULL;
static TaskHandle_t buttonTaskHandle = NULL;
// Queue to request track playback from PCF events (handled in main loop)
static QueueHandle_t pcfPlayQueue = NULL;

float usbVoltage = 0;
float batteryVoltage = 0;
// Adjust these to your resistor divider ratios: Vreal = Vadcpin * GAIN
// Example: two equal resistors -> GAIN = 2.0f
static const float USB_DIVIDER_GAIN = 2.0f;
static const float BATTERY_DIVIDER_GAIN = 2.0f;

static void playTrackIndex(uint8_t trackIndex)
{
    if (files_list.size() > trackIndex)
    {
        Serial.printf("[PCF8575] Playing track %u: %s\n", trackIndex, files_list[trackIndex].c_str());
        audio.connecttoFS(SD, files_list[trackIndex].c_str());
    }
    else
    {
        Serial.printf("[PCF8575] Track %u out of range (files: %u)\n", trackIndex, (unsigned)files_list.size());
    }
}

void IRAM_ATTR isrBtnInc()
{
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    ButtonEvent evt = BTN_EVT_INC;
    if (buttonQueue)
        xQueueSendFromISR(buttonQueue, &evt, &xHigherPriorityTaskWoken);
    if (xHigherPriorityTaskWoken)
        portYIELD_FROM_ISR();
}

void IRAM_ATTR isrBtnDec()
{
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    ButtonEvent evt = BTN_EVT_DEC;
    if (buttonQueue)
        xQueueSendFromISR(buttonQueue, &evt, &xHigherPriorityTaskWoken);
    if (xHigherPriorityTaskWoken)
        portYIELD_FROM_ISR();
}

void IRAM_ATTR isrBtnPlayPause()
{
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    ButtonEvent evt = BTN_EVT_PLAY_PAUSE;
    if (buttonQueue)
        xQueueSendFromISR(buttonQueue, &evt, &xHigherPriorityTaskWoken);
    if (xHigherPriorityTaskWoken)
        portYIELD_FROM_ISR();
}

void IRAM_ATTR isrPCFInt()
{
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    ButtonEvent evt = BTN_EVT_PCF_INT;
    if (buttonQueue)
        xQueueSendFromISR(buttonQueue, &evt, &xHigherPriorityTaskWoken);
    if (xHigherPriorityTaskWoken)
        portYIELD_FROM_ISR();
}

