juthomas/I2S-ESP32-SD/src/main.cpp
// Configure all PCF8575 pins with pull up/pull down
void pcfConfigureAllOutputs()
{
    for (uint8_t pin = 0; pin < 16; ++pin)
    {
        PCF.write(pin, PCF_PULL_STATE);
    }
}

void buttonTask(void *param)
{
    ButtonEvent evt;
    TickType_t lastChange = 0;
    const TickType_t debounceTicks = pdMS_TO_TICKS(120);
    for (;;)
    {
        if (xQueueReceive(buttonQueue, &evt, portMAX_DELAY) == pdTRUE)
        {
            TickType_t now = xTaskGetTickCount();
            if (evt != BTN_EVT_PCF_INT && (now - lastChange < debounceTicks))
                continue;
            lastChange = now;

            if (evt == BTN_EVT_INC && currentBalance < 16)
            {
                currentBalance++;
                audio.setBalance(currentBalance);
                Serial.printf("[BTN IO14] Balance: %d\n", currentBalance);
            }
            else if (evt == BTN_EVT_DEC && currentBalance > -16)
            {
                currentBalance--;
                audio.setBalance(currentBalance);
                Serial.printf("[BTN IO16] Balance: %d\n", currentBalance);
            }
            else if (evt == BTN_EVT_PLAY_PAUSE)
            {
                audio.pauseResume();
                Serial.printf("[BTN IO33] %s\n", audio.isRunning() ? "Resumed" : "Paused");
            }
            else if (evt == BTN_EVT_PCF_INT)
            {
                pcfConfigureAllOutputs();
                delay(1);
                uint16_t pcfValue = 0;
                for (uint8_t pin = 0; pin < 16; ++pin)
                {
                    if (PCF.read(pin)) pcfValue |= (1u << pin);
                }
                Serial.printf("[PCF8575 INT] value=0x%04X\n", pcfValue);

                // Detect falling edges (HIGH -> LOW), PCF INT is active low
                uint16_t falling = (~pcfValue) & pcfPrevValue;
                if (falling)
                {
                    // Play the first matching pin index (lowest index wins)
                    for (uint8_t pin = 0; pin < 16; ++pin)
                    {
                        if (falling & (1u << pin))
                        {
                            if (pcfPlayQueue)
                            {
                                uint8_t idx = pin;
                                xQueueSend(pcfPlayQueue, &idx, 0);
                            }
                            break;
                        }
                    }
                }
                pcfPrevValue = pcfValue;
            }
        }
    }
}

String getContentType(String filename)
{
    if (filename.endsWith(".htm") || filename.endsWith(".html"))
        return "text/html";
    else if (filename.endsWith(".css"))
        return "text/css";
    else if (filename.endsWith(".js"))
        return "application/javascript";
    else if (filename.endsWith(".png"))
        return "image/png";
    else if (filename.endsWith(".jpg") || filename.endsWith(".jpeg"))
        return "image/jpeg";
    else if (filename.endsWith(".gif"))
        return "image/gif";
    else if (filename.endsWith(".ico"))
        return "image/x-icon";
    else if (filename.endsWith(".xml"))
        return "text/xml";
    else if (filename.endsWith(".pdf"))
        return "application/pdf";
    else if (filename.endsWith(".zip"))
        return "application/zip";
    else if (filename.endsWith(".gz"))
        return "application/x-gzip";

    return "text/plain";
}

String local_vars_to_json()
{
    StaticJsonDocument<2048> doc;

    doc["loop_file"] = loop_file;
    doc["auto_play"] = auto_play;
    doc["note"] = note;
    doc["udp_port"] = localPort;
    doc["volume"] = volume;
    for (std::vector<t_music_data>::size_type i = 0; i != music_data.size(); i++)
    {
        doc["track_assignation"][i]["path"] = music_data[i].path;
        doc["track_assignation"][i]["index"] = music_data[i].index;
    }
    String buff;
    serializeJsonPretty(doc, buff);
    return (buff);
}

void update_spiffs()
{
    char *filePath = "/data.json";
    fs::File file = SPIFFS.open(filePath, "w");
    file.print(local_vars_to_json().c_str());
    file.close();
}

void json_to_local_vars(uint8_t *data)
{
    StaticJsonDocument<2048> doc;

    DeserializationError error = deserializeJson(doc, data);
    if (error)
    {
        Serial.println(error.c_str());
        return;
    }

    if (doc.containsKey("loop_file"))
    {
        bool tmp_loop_file = doc["loop_file"].as<const bool>();
        if (tmp_loop_file != loop_file)
        {
            loop_file = tmp_loop_file;
            audio.setFileLoop(loop_file);
        }
    }
    if (doc.containsKey("auto_play"))
        auto_play = doc["auto_play"].as<const bool>();
    if (doc.containsKey("note"))
        note = doc["note"].as<String>();
    if (doc.containsKey("udp_port"))
        localPort = doc["udp_port"].as<unsigned int>();
    if (doc.containsKey("volume"))
    {
        uint8_t tmp_volume = doc["volume"].as<unsigned char>();
        if (tmp_volume != volume)
        {
            volume = tmp_volume;
            audio.setVolume(volume);
        }
    }
    if (doc.containsKey("track_assignation"))
    {
        music_data.clear();
        for (uint16_t i = 0; i < doc["track_assignation"].size(); i++)
        {
            music_data.push_back((t_music_data){.path = doc["track_assignation"][i]["path"].as<String>(),
                                                .index = doc["track_assignation"][i]["index"].as<unsigned char>()});
        }
    }
}

void load_spiffs()
{
    char *filePath = "/data.json";
    fs::File file = SPIFFS.open(filePath, "r");
    if (!file)
    {
        Serial.println("Failed to open file for reading");
        return;
    }
    Serial.printf("File Size : %d\n", file.size());
    Serial.printf("Free Heap : %d\n", ESP.getFreeHeap());
    uint8_t *buff;
    size_t read_index = 1;
    size_t buff_size = file.size();
    buff = (uint8_t *)malloc(sizeof(char) * (buff_size + 1));
    if ((read_index = file.read(buff, (buff_size))) > 0)
    {
        buff[read_index] = '\0';
        Serial.printf("[SPIFFS]\n%s", buff);
    }
    else
    {
        Serial.printf("Error reading SPIFFS");
    }

