juthomas/I2S-ESP32-SD/src/main.cpp
    // Écrire les données dans le fichier
    if (uploadFile)
    {
        if (uploadFile)
            uploadFile.write(data, len);
        Serial.print("Upload: WRITE, Bytes: ");
        Serial.println(len);
    }

    // S'il s'agit du dernier fragment du fichier, fermer le fichier
    if (final)
    {
        if (uploadFile)
            uploadFile.close();
        Serial.print("Upload: END :");
        Serial.println(len);
        update_music_from_sd();
        request->send(200);
    }
}

// Simple I2C scanner to help debug PCF presence on the bus
void scanI2CBus()
{
    byte error;
    byte address;
    int nDevices = 0;
    Serial.println("I2C scan start");
    for (address = 1; address < 127; address++)
    {
        Wire.beginTransmission(address);
        error = Wire.endTransmission();
        if (error == 0)
        {
            Serial.printf("I2C device found at 0x%02X\n", address);
            nDevices++;
        }
        else if (error == 4)
        {
            Serial.printf("Unknown error on address 0x%02X\n", address);
        }
    }
    if (nDevices == 0)
    {
        Serial.println("No I2C devices found");
    }
    else
    {
        Serial.printf("I2C scan done, %d device(s) found\n", nDevices);
    }
}



void setup()
{
    pinMode(SD_CS, OUTPUT);
    pinMode(I2S_ENABLE, OUTPUT);
    digitalWrite(I2S_ENABLE, 1);
    pinMode(BTN_INC_BAL, INPUT_PULLUP);
    pinMode(BTN_DEC_BAL, INPUT_PULLUP);
    pinMode(BTN_PLAY_PAUSE, INPUT_PULLUP);
    pinMode(CHRG_STATUS, INPUT);
    pinMode(LED_IO4, OUTPUT);
    pinMode(USB_VOLTAGE_PIN, INPUT);
    pinMode(BATTERY_VOLTAGE_PIN, INPUT);
    digitalWrite(LED_IO4, LOW);

    // Initialize NeoPixel strip
    strip.begin();
    strip.setBrightness(10);
    strip.show();

  // Configure ADC width and per-pin attenuation (11 dB ~ up to ~3.3 V)
  analogSetWidth(12);
  analogSetPinAttenuation(USB_VOLTAGE_PIN, ADC_11db);
  analogSetPinAttenuation(BATTERY_VOLTAGE_PIN, ADC_11db);
    // Setup FreeRTOS queue and task for button events
    buttonQueue = xQueueCreate(8, sizeof(ButtonEvent));
    // Increase stack to withstand queue ops and PCF ISR handling
    xTaskCreatePinnedToCore(buttonTask, "buttonTask", 4096, NULL, 2, &buttonTaskHandle, 1);
    // Attach interrupts on falling edge (active low buttons)
    attachInterrupt(digitalPinToInterrupt(BTN_INC_BAL), isrBtnInc, FALLING);
    attachInterrupt(digitalPinToInterrupt(BTN_DEC_BAL), isrBtnDec, FALLING);
    attachInterrupt(digitalPinToInterrupt(BTN_PLAY_PAUSE), isrBtnPlayPause, FALLING);
    // PCF8575 interrupt line on GPIO15
    pinMode(PCF_INT_PIN, INPUT_PULLUP);
    attachInterrupt(digitalPinToInterrupt(PCF_INT_PIN), isrPCFInt, FALLING);
    digitalWrite(SD_CS, HIGH);
    SPI.begin(SPI_SCK, SPI_MISO, SPI_MOSI);
    Serial.begin(115200);

    // Initialize I2C explicitly on ESP32 default pins (SDA=21, SCL=22)
    Wire.begin(21, 22);
    Wire.setClock(100000); // 100 kHz for robust scanning

    if (!PCF.begin())
    {
      Serial.println("could not initialize...");
    }
    if (!PCF.isConnected())
    {
      Serial.println("=> not connected");
      scanI2CBus();
    }
    else
    {
      Serial.println("=> connected!!");
      // Configure all lines as inputs and read their initial states
      pcfConfigureAllOutputs();
      // Prime previous value with current readout to avoid false edges
      uint16_t initValue = 0;
      for (uint8_t pin = 0; pin < 16; ++pin)
      {
          if (PCF.read(pin)) initValue |= (1u << pin);
      }
      pcfPrevValue = initValue;
    }

    // Queue for deferred audio playback from PCF events
    pcfPlayQueue = xQueueCreate(8, sizeof(uint8_t));

    if (!SD.begin(SD_CS))
    {
        Serial.println("SD initialization failed!");
        while (1)
            ;
    }
    Serial.println("SD initialization done.");
    if (!SPIFFS.begin())
    {
        Serial.println("SPIFFS initialization failed !");
        while (1)
            ;
        // return;
    }
    Serial.println("SPIFFS initialization done.");
    load_json_config_on_sd("/config.json");

    load_spiffs();
    Serial.printf("JSON : %s/n", local_vars_to_json().c_str());
    WiFi.mode(WIFI_AP);
    // Optional: ensure a common AP IP like 192.168.4.1
    WiFi.softAP(ssid.c_str(), password.c_str());

    // Start DNS server for captive portal: resolve all domains to AP IP
    dnsServer.start(53, "*", WiFi.softAPIP());

    Serial.print("Starting AP \"" + ssid + "\"");
    delay(100);
    Serial.println("... done");
    digitalWrite(2, 0); ///
    udp.begin(localPort);
    if (DEBUG)
    {
        Serial.begin(115200);
        Serial.print("IP: ");
        Serial.println(WiFi.softAPIP());
    }
    server.on("/", HTTP_ANY, [](AsyncWebServerRequest *request)
              { request->send(SPIFFS, "/index.html", String(), false); });
    // Captive portal endpoints used by OS connectivity checks
    // Android
    server.on("/generate_204", HTTP_ANY, [](AsyncWebServerRequest *request) { request->send(200, "text/html", "<html><meta http-equiv=\"refresh\" content=\"0; url=/\"></html>"); });
    // iOS/macOS
    server.on("/hotspot-detect.html", HTTP_ANY, [](AsyncWebServerRequest *request) { request->send(200, "text/html", "<HTML><HEAD><TITLE>Success</TITLE></HEAD><BODY>Success</BODY></HTML>"); });
    server.on("/success.html", HTTP_ANY, [](AsyncWebServerRequest *request) { request->send(200, "text/html", "Success"); });
    // Windows
    server.on("/ncsi.txt", HTTP_ANY, [](AsyncWebServerRequest *request) { request->send(200, "text/plain", "Microsoft NCSI"); });
    server.on("/connecttest.txt", HTTP_ANY, [](AsyncWebServerRequest *request) { request->send(200, "text/plain", "" ); });
    server.on("/library/test/success.html", HTTP_ANY, [](AsyncWebServerRequest *request) { request->send(200, "text/html", "Success"); });
    server.on("/success.txt", HTTP_ANY, [](AsyncWebServerRequest *request) { request->send(200, "text/plain", "Success"); });
    // server.on(
    //     "/edit", HTTP_POST, [](AsyncWebServerRequest *request)
    //     { request->send(200); },
    //     handleFileUpload);
    server.on("/data", HTTP_GET, [](AsyncWebServerRequest *request)
              {Serial.printf("Json demandé par le site\n");
              request->send(200, "application/json", local_vars_to_json()); });
    server.on(
        "/play", HTTP_POST, [](AsyncWebServerRequest *request) {}, NULL, handlePlay);
    server.on(
        "/stop", HTTP_POST, [](AsyncWebServerRequest *request) {}, NULL, handleStop);
    server.on(
        "/delete", HTTP_POST, [](AsyncWebServerRequest *request) {}, NULL, handleDelete);
    server.on(
        "/settings", HTTP_POST, [](AsyncWebServerRequest *request) {}, NULL, handleSettings);
    server.onFileUpload(handleFileUpload);
    // server.on("/edit", HTTP_POST, handleFileUpload2);

    server.serveStatic("/index.css", SPIFFS, "/index.css");
    server.serveStatic("/index.js", SPIFFS, "/index.js");
    // server.serveStatic("/background.png", SPIFFS, "/background.png");
    // server.serveStatic("/react.svg", SPIFFS, "/react.svg");
    server.serveStatic("/vite.svg", SPIFFS, "/vite.svg");
    server.onNotFound(handleRequest);

    server.begin();

    audio.setPinout(I2S_BCLK, I2S_LRC, I2S_DOUT);
    update_music_from_sd();
    // printf("test : %s\n", files_list[1].c_str());
    if (auto_play)
    {
        audio.connecttoFS(SD, files_list[0].c_str());
    }
    if (loop_file)
    {
        audio.setFileLoop(true);
    }

    audio.setVolumeSteps(255); // max 255
    audio.setVolume(volume);
    // Initialize balance to center on boot
    currentBalance = 0;
    audio.setBalance(currentBalance);
}

bool need_to_play = true;

