juthomas/I2S-ESP32-SD/src/main.cpp
uint16_t current_Volume = 4095;
char packetBuffer[255]; // Incoming

// Méthode pour découper le message avec un séparateur (ou "parser")
void splitString(String message, char separator, String data[5])
{

    int index = 0;
    int cnt = 0;
    do
    {
        index = message.indexOf(separator);
        // s'il y a bien un caractère séparateur
        if (index != -1)
        {
            // on découpe la chaine et on stocke le bout dans le tableau
            data[cnt] = message.substring(0, index);
            cnt++;
            // on enlève du message le bout stocké
            message = message.substring(index + 1, message.length());
        }
        else
        {
            // après le dernier espace
            // on s'assure que la chaine n'est pas vide
            if (message.length() > 0)
            {
                data[cnt] = message.substring(0, index); // dernier bout
                cnt++;
            }
        }
    } while (index >= 0); // tant qu'il y a bien un séparateur dans la chaine
}

void loop()
{
    audio.loop();
    dnsServer.processNextRequest();
    // Prefer calibrated millivolts API for better accuracy on ESP32
    uint32_t usbMv = analogReadMilliVolts(USB_VOLTAGE_PIN);
    usbVoltage = (usbMv / 1000.0f) * USB_DIVIDER_GAIN;
    uint32_t batMv = analogReadMilliVolts(BATTERY_VOLTAGE_PIN);
    // Note: ADC2 (GPIO13) reads 0 when WiFi is active; move battery sense to an ADC1 pin
    static bool warnedAdc2 = false;
    if (batMv == 0 && !warnedAdc2)
    {
        Serial.println("[Battery] ADC2 pin may be blocked by WiFi. Use an ADC1 pin (e.g., 32-35/36-39).");
        warnedAdc2 = true;
    }
    if (batMv > 0)
    {
        batteryVoltage = (batMv / 1000.0f) * BATTERY_DIVIDER_GAIN;
    }
    // Blink LEDs on IO12 and IO4 (toggle every 500 ms)
    static uint32_t lastBlinkMs = 0;
    static bool blinkState = false;
    uint32_t nowMs = millis();
    if (nowMs - lastBlinkMs >= 1000)
    {
        Serial.printf("USB Voltage: %f V, Battery Voltage: %f V\n", usbVoltage, batteryVoltage);
        lastBlinkMs = nowMs;
        blinkState = !blinkState;
        uint8_t chrgStatus = digitalRead(CHRG_STATUS);
        // If charge status is 1, then the battery is charging
        Serial.printf("CHRG Status: %d\n", chrgStatus);
        // digitalWrite(CHRG_STATUS, blinkState ? LOW : HIGH);
        if (usbVoltage > 4.0 && chrgStatus == 1)
        {
            strip.setBrightness(blinkState ? 4 : 10);
        }
        else
        {
            strip.setBrightness(10);
        }
    }
    // Drive NeoPixel rainbow animation
    updateRainbow(nowMs);
    // PCF8575 interrupt processing moved to FreeRTOS task (pcfIntTask)
    // Button handling moved to ISR + FreeRTOS task
    // Handle deferred playback requests from PCF task
    uint8_t playIdx;
    while (pcfPlayQueue && xQueueReceive(pcfPlayQueue, &playIdx, 0) == pdTRUE)
    {
        playTrackIndex(playIdx);
    }
    int packetSize = udp.parsePacket();
    if (packetSize)
    {
        // Read the packet into packetBuffer
        int len = udp.read(packetBuffer, 255);
        if (len > 0)
        {
            packetBuffer[len] = 0;
        }
        Serial.printf("Data : %s\n", packetBuffer);
        String strData(packetBuffer);
        String data[5]; // Store incoming data

        splitString(strData, ' ', data);
        if (data[0].c_str()[0] == 'V')
        {
            // Volume
            // "V 0" to "V 255"
            Serial.printf("Set Volume to : %d\n", data[1].toInt());
            audio.setVolume(data[1].toInt());
        }
        else if (data[0].c_str()[0] == 'P')
        {
            // Pause / Resume
            // "P" or "P 0" or "P 1"
            int8_t action = -1;
            if (data[1] != "")
            {
                Serial.printf("Second argument is %d\n", data[1].toInt());
                action = data[1].toInt();
            }
            if ((action == 0 && audio.isRunning()) || (action == 1 && !audio.isRunning()) || action == -1)
            {
                audio.pauseResume();
                Serial.printf("Music %s\n", audio.isRunning() ? "Resumed" : "Paused");
            }
            else
            {
                Serial.printf("Music allready %s\n", audio.isRunning() ? "Resumed" : "Paused");
            }
        }
        else if (data[0].c_str()[0] == 'L')
        {
            // Loop file
            // "L" or "L 0" or "L 1"
            int8_t action = -1;
            if (data[1] != "")
            {
                Serial.printf("Second argument is %d\n", data[1].toInt());
                action = data[1].toInt();
            }
            if ((action == -1 && loop_file == false) || action == 1)
            {
                audio.setFileLoop(true);
                loop_file = true;
                Serial.printf("File loop activated\n");
            }
            else if ((action == -1 && loop_file == true) || action == 0)
            {
                audio.setFileLoop(false);
                loop_file = false;
                Serial.printf("File loop deactivated\n");
            }
            else
            {
                Serial.printf("File loop unchanged (%d)\n", loop_file);
            }
        }
        else if (data[0].c_str()[0] == 'B')
        {
            // Balance
            // "B -16" to "B 16"
            //-16 to 16
            audio.setBalance(data[1].toInt());
            Serial.printf("Balance set to \n", data[1].toInt());
        }
        else if (data[0].c_str()[0] == 'J')
        {
            // Jump at position in audio file
            //"J 500" jump in audio file to time
            audio.setAudioPlayPosition(data[1].toInt());
            Serial.printf("Jump in audio file to %dsecs \n", data[1].toInt());
        }
        // else if (data[0].c_str()[0] == 'J')
        // {
        //     //"J 500" jump in audio file to time
        //     audio.setAudioPlayPosition(data[1].toInt());
        //     Serial.printf("Jump in audio file to %dsecs \n", data[1].toInt());
        // }
        else if (data[0].c_str()[0] == 'T')
        {
            // Set Tonality (more like an equalizer)
            //"T -40 0 6" values can be between -40 ... +6 (dB)
            audio.setTone(data[1].toInt(), data[2].toInt(), data[3].toInt());
            Serial.printf("Tone set to low:%d band:%d high:%d\n", data[1].toInt(), data[2].toInt(), data[3].toInt());
        }
        else if (data[0].c_str()[0] == 'I')
        {
            // // Set GPIO to value
            // if (data[1].toInt() == 13)
            // {
            //     ledcWrite(0, data[2].toInt());
            //     Serial.printf("GPIO 13 set to :%d\n", data[2].toInt());
            // }
            // else if (data[1].toInt() == 16)
            // {
            //     // IO16 is used as a button input; ignore PWM writes
            //     Serial.printf("GPIO 16 is reserved for button input, ignoring write\n");
            // }
        }
        else
        {
            // Play track
            //"0" to "N" number of tracks in playlist
            uint16_t audio_to_play = data[0].toInt();
            if (files_list.size() > audio_to_play)
            {
                printf("Playing : %s\n", files_list[audio_to_play].c_str());
                audio.connecttoFS(SD, files_list[audio_to_play].c_str());
            }
            else
            {
                printf("Sound number %d is out of range\n", audio_to_play);
            }
            if (loop_file)
            {
                audio.setFileLoop(true);
            }
        }
    }
}

// optional
void audio_info(const char *info)
{
    Serial.print("info        ");
    Serial.println(info);
}
void audio_id3data(const char *info)
{ // id3 metadata
    Serial.print("id3data     ");
    Serial.println(info);
}
void audio_eof_mp3(const char *info)
{ // end of file
    Serial.print("eof_mp3     ");
    Serial.println(info);
    need_to_play = true;
    //  audio.connecttoFS(SD, "/audio.wav");     // SD
}
void audio_showstation(const char *info)
{
    Serial.print("station     ");
    Serial.println(info);
}
void audio_showstreamtitle(const char *info)
{
    Serial.print("streamtitle ");
    Serial.println(info);
}
void audio_bitrate(const char *info)
{
    Serial.print("bitrate     ");
    Serial.println(info);
}
void audio_commercial(const char *info)
{ // duration in sec
    Serial.print("commercial  ");
    Serial.println(info);
}
void audio_icyurl(const char *info)
{ // homepage
    Serial.print("icyurl      ");
    Serial.println(info);
}
void audio_lasthost(const char *info)
{ // stream URL played
    Serial.print("lasthost    ");
    Serial.println(info);
}
void audio_eof_speech(const char *info)
{
    Serial.print("eof_speech  ");
    Serial.println(info);
}